# 1. Створить вектор v із 100 елементів командою 
v <- rnorm(100)
# Для цього вектору виведіть: 10-й елемент; 
print(v[10])
# [1] -1.99582

# елементи з 10-го по 20-й включно; 
print(v[10:20])
# [1] -1.99582047 -0.60944280  0.48372308  0.07815548  1.14846130 -1.60138557  0.40510209
# [8] -0.14094990 -0.64539907 -1.41899452 -0.41912599

# 10 елементів починаючи з 20-го; 
print(v[20:29])
# [1] -0.41912599 -0.33938835 -1.40297714  0.35520822 -0.02279995  2.27617982  0.31232509
# [8]  0.83190215 -0.57116728 -0.08581255

# елементи більше 0.
print(v[v > 0])
# [1] 0.025852229 0.093586227 0.009510213 1.592884263 0.038356953 0.483723083 0.078155478
# [8] 1.148461303 0.405102093 0.355208218 2.276179825 0.312325093 0.831902155 0.473964558
# [15] 0.337832759 0.378066792 0.098366265 0.618436991 1.326742042 0.656824030 1.527205944
# [22] 1.087590023 1.036149844 2.236580049 1.555746831 0.148126967 0.850595436 1.121322560
# [29] 0.379673075 0.559219014 0.380939909 0.052143071 1.419863967 0.587842071 0.537814467
# [36] 1.142851499 0.678279832 0.559622978 0.194014952 1.022656883 1.055981733 0.589747307
# [43] 1.322725926 2.138351283 0.792734173 0.205202259 0.681268777 0.190038583 1.566285309
# [50] 0.706093171 0.944702860 0.290043174 1.668276423 0.156888635

# 2. Створити фрейм (data frame) y командою 
y<- data.frame(a = rnorm(100), b = 1:100, cc = sample(letters, 100, replace = TRUE))
# Для цього data frame виведіть: останні 10 строк; 
print(y[91:100, ])
# 91  -0.3877743  91  l
# 92  -0.6527967  92  t
# 93  -1.7976447  93  d
# 94   0.6633896  94  a
# 95  -0.1041508  95  y
# 96  -0.8538627  96  s
# 97   0.9199097  97  c
# 98  -0.4790173  98  p
# 99   1.1534505  99  f
# 100  0.6283568 100  f

# строки з 10 по 20 включно; 
print(y[10:20, ])
# 10 -0.11628567 10  a
# 11  0.47531421 11  k
# 12 -1.18850925 12  p
# 13  0.01078654 13  u
# 14 -0.48468180 14  p
# 15  1.88393992 15  y
# 16 -0.92336570 16  g
# 17 -1.14494208 17  x
# 18  0.11892316 18  y
# 19  0.31136657 19  n
# 20 -0.33319796 20  b

# 10-й елемент стовпця b; 
print(y[10, "b"])
#[1] 10

# повністю стовпець cc, при цьому використайте ім’я стовпця.
print(y[, "cc"])
# [1] l l k b p w a e g a k p u p y g x y n b u i b j k o u u p v m j x v g i i y v o b b x x b
# [46] y k p v u k f w q a h c w g d m c o a q e p p y b y u v w e m o r n a t z d h d l w i a g
# [91] l t d a y s c p f f
# Levels: a b c d e f g h i j k l m n o p q r s t u v w x y z

# 3. Створити вектор z з елементами 1, 2, 3, NA, 4, NA, 5, NA.
z <- c(1, 2, 3, NA, 4, NA, 5, NA)

# Для цього вектору: виведіть всі елементи, які не NA; 
print(z[!is.na(z)])
# [1] 1 2 3 4 5

# підрахуйте середнє значення всіх елементів цього вектору без NA значень 
print(mean(z[!is.na(z)]))
# [1] 3

# та з NA значеннями.
print(mean(z))
# [1] NA

# or, we could assume, that NA elements don't differ from average 
# (in case, when we need any result)
print(sum(z[!is.na(z)]) / length(z))
# [1] 1.875
